<div>
    <h1> Developing a Retail Application Database </h3>
    <h3> Micah Simmerman </h3>
    <h3> CSPB 3287 Semester Project </h3>
</div>

In [42]:
import os
import configparser
from sqlalchemy import create_engine, select
import sqlalchemy.sql

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")

database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [jasi9001]
Database: [[mysql://jasi9001...@applied-sql.cs.colorado.edu:3306/jasi9001]

In [43]:
%reload_ext sql
%matplotlib inline
%sql SELECT version()

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[('8.0.27',)]

In [71]:
%%sql
drop table if exists adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [117]:
%%sql
DROP TABLE IF EXISTS user_address;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [164]:
%%sql
drop table if exists user_payment;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [190]:
%%sql
drop table if exists product_category;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [189]:
%%sql
drop table if exists product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [208]:
%%sql
drop table if exists product_inventory;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [67]:
%%sql
drop table if exists product_discount;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [54]:
%%sql
drop table if exists user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# Introduction
<hr/>

A primary motivation when designing an ecommerce database is the facilitation of efficient computation and search queries. Another consideration is maximizing the schema's compatibility with alternative database systems, including popular noSQL databases, such as key-value pair, wide-column (AKA column-family), and document databases (e.g., MongoDB). By systematically applying auto-incremented primary keys to every table, we can enable a sparse index on the primary key of every relation in the database. This is a very efficient way to organize a relational database (as we shall see) that facilitates high volume transactions and evenly distributed processing speeds throughout the database. The availability of primary keys in this system also enables easy joining and comparison of relations accross the entire database schema. Single record and range-based lookups are simple and fast. This primary key system also ensures that the data maintains some indication of chronological ordering throughout its' lifecycle. This can be useful for fraud detection, as well as recovery from potential data loss.
<br><br>
The tables in this notebook are designed to support an ecommerce software system in many ways. This support ranges from basic storage of user information to transactions involving credit card data, along with many others. For the sake of simplicity, we will forego 'deleted_at' timestamps here and assume that deleted records are being handled by a separate archive system.

# The User-Admin Management Tier
<b><hr/></b>

The user-admin management tier handles user data. There are two basic user categories in this system: users with admin privileges and users without. Users with admin privileges are distinguished by their 'admin_type' as we'll see shortly.

In [55]:
%%sql
# User table is the central table in the user-admin management tier.
CREATE TABLE user (
    user_id INT PRIMARY KEY AUTO_INCREMENT,  # INT AUTO primary keys are used accross the database.
    username VARCHAR(30) UNIQUE,
    password NVARCHAR(30),
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email VARCHAR(300) UNIQUE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [56]:
user_data_1 = [["user_01","user_passwd_01","Joe","Murr", "user_01_@email.com"],
               ["user_02","user_passwd_02","Brice","Toven", "user_02_@email.com"],
               ["user_03","user_passwd_03","Jen","Jackson", "user_03_@email.com"],
               ["user_04","user_passwd_04","Tammy","Smith", "user_04_@email.com"],
               ["user_05","user_passwd_05","Melanie ","Baldwin", "user_05_@email.com"],
               ["admin_06","admin_passwd_06","Rene ","Pratt", "admin_06_@email.com"],
               ["admin_07","admin_passwd_07","Malik ","Coleman", "admin_07_@email.com"],
               ["admin_08","admin_passwd_08","Sheldon ","Wolf", "admin_08_@email.com"],
               ["admin_09","admin_passwd_09","Ramiro","Blackwell", "admin_09_@email.com"],
               ["admin_10","admin_passwd_10","Suzy","Q", "admin_10_@email.com"],  # Ramiro made two accounts
               # The next two inserts should fail due to UNIQUE unsername and email constraints, respectively.
               # ["user_01","test_password_01","Duplicate","Username", "un_test_email@email.com"],
               # ["poser_08","test_password_08","Duplicate","Email", "user_01_@email.com"]
              ]

In [57]:
insert_users = """
INSERT INTO 
    user (username, password, first_name, last_name, email)
VALUES
    ("%s","%s","%s","%s", "%s");
"""
count = 1
for user in user_data_1:
    try:
        res = con.execute(insert_users, user[0], user[1], user[2], user[3], user[4])
        print("Insert:", user[2], user[3], "insert was successful.")
    except:
        print("Insert:", user[2], user[3], " insert FAILED.")
    count+=1

Insert: Joe Murr insert was successful.
Insert: Brice Toven insert was successful.
Insert: Jen Jackson insert was successful.
Insert: Tammy Smith insert was successful.
Insert: Melanie  Baldwin insert was successful.
Insert: Rene  Pratt insert was successful.
Insert: Malik  Coleman insert was successful.
Insert: Sheldon  Wolf insert was successful.
Insert: Ramiro Blackwell insert was successful.
Insert: Suzy Q insert was successful.
Insert: Duplicate Username  insert FAILED.
Insert: Duplicate Email  insert FAILED.

In [92]:
%%sql
SELECT * FROM user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'user_01'", "'user_passwd_01'", "'Joe'", "'Murr'", "'user_01_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (2, "'user_02'", "'user_passwd_02'", "'Brice'", "'Toven'", "'user_02_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 54)),
 (4, "'user_04'", "'user_passwd_04'", "'Tammy'", "'Smith'", "'user_04_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (5, "'user_05'", "'user_passwd_05'", "'Melanie '", "'Baldwin'", "'user_05_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (6, "'admin_06'", "'admin_passwd_06'", "'Rene '", "'Pratt'", "'admin_06_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (7, "'admin_07'", "'admin_passwd_07'", "'Malik '", "'Coleman'", "'admin_07_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (8, "'admin_08'", "'admin_passwd_08'", "'Sheldon '", "'Wolf'", "'admin_08_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (9, "'admin_09'", "'admin_passwd_09'", "'Ramiro'", "'Blackwell'", "'admin_09_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47)),
 (10, "'admin_10'", "'admin_passwd_10'", "'Suzy'", "'Q'", "'admin_10_@email.com'", datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 47))]

### Test the 'modified_at' on-update timestamp trigger.
<p>Now we make sure that the on-update trigger was placed on <b>user.modified_at</b> by changing the email of user 3, Brice Toven.</p>

In [59]:
%%sql
# Change Brice Toven's email to make sure the update trigger is working properly.
UPDATE user
SET
    email = 'brice_toven_07@gmail.com'  # CHANGE A VALUE TO TEST THE UPDATE TRIGGER
WHERE
    user_id = 3;
    
SELECT * FROM user WHERE user_id = 3;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 30, 4, 14, 47), datetime.datetime(2023, 4, 30, 4, 14, 54))]

# The adminuser table
<hr/>

### Rene Pratt, Malik Coleman, Sheldon Wolf, and Ramiro Blackwell have different roles in the P2P Ecommmerce system. 

    -Rene is a Business Admin for company X, a company that sells items on the website. Rene needs access to create and modify her company's new product listings.
    -Malik is a requisitioner for Company X, he manages inventory.
    -Sheldon works in the IT department of our P2P company, and has been on a roll at work lately.
    -Ramiro works in the shipping warehouses, he needs access to check on the status of existing orders.

### The "admin_type" attribute determines the adminuser's data access permissions.

Sheldon just received a promotion that grants him a higher security clearance. Let's see how the adminuser table can help us update his user permissions using Sheldon's user_id. <b>This will also give us a chance to test the on-insert and on-update triggers on the 'created_at' and 'modified_at' attributes, respectively.</b>

In [72]:
%%sql
CREATE TABLE adminuser (
    admin_id INT PRIMARY KEY AUTO_INCREMENT,  # foreign key, references 'user.user_id'
    user_id INT,
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    admin_type VARCHAR(30),  # BusinessAdmin / Requisitioner / IT / Warehouse
    permissions VARCHAR(30),  # '01_admin' / '02_purchaser' / '03_IT' / '04_warehouse'
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(user_id, first_name),  # duplicate admin records are a no-no.
    CONSTRAINT ADMINUSER_isA_USER FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

A table like adminuser could be used to monitor, update, and control user access privileges.

In [73]:
admins = [[6, "Rene ","Pratt", 'BusinessAdmin', '01_admin'],
          [7, "Malik ","Coleman", 'Requisitioner', '02_purchaser'],
          [8, "Sheldon ", "Wolf",  'IT', '03_IT'],
          [9, "Ramiro","Blackwell", 'Warehouse', '04_warehouse'],
          [10, "Suzy","Q", 'Warehouse', '04_warehouse']]

In [74]:
insert_admins = """
INSERT INTO 
    adminuser (user_id, first_name, last_name, admin_type, permissions)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for admin in admins:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_admins, admin[0], admin[1], admin[2], admin[3], admin[4])
        print("Insert for admin:", admin[1], admin[2], "was successful.")
    except:
        print("Insert for admin:", admin[1], admin[2], "has FAILED.")

Insert for admin: Rene  Pratt was successful.
Insert for admin: Malik  Coleman was successful.
Insert for admin: Sheldon  Wolf was successful.
Insert for admin: Ramiro Blackwell was successful.
Insert for admin: Suzy Q was successful.

### Upgrade Sheldon's admin permissions by his employee ID.

In [75]:
%%sql
select * from adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
5 rows affected.

[(1, 6, "'Rene '", "'Pratt'", "'BusinessAdmin'", "'01_admin'", datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 7)),
 (2, 7, "'Malik '", "'Coleman'", "'Requisitioner'", "'02_purchaser'", datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 7)),
 (3, 8, "'Sheldon '", "'Wolf'", "'IT'", "'03_IT'", datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 7)),
 (4, 9, "'Ramiro'", "'Blackwell'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 7)),
 (5, 10, "'Suzy'", "'Q'", "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 7))]

In [77]:
%%sql

UPDATE adminuser
SET
    permissions = '04_IT'
WHERE
    adminuser.admin_id = 3;

SELECT first_name, last_name, admin_type, permissions, created_at, modified_at FROM adminuser
WHERE adminuser.admin_type LIKE '\'IT%\'';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[("'Sheldon '", "'Wolf'", "'IT'", '04_IT', datetime.datetime(2023, 4, 30, 20, 24, 7), datetime.datetime(2023, 4, 30, 20, 24, 34))]

<b>Congratulations, Sheldon!</b> 
<br><br>
The <b><u>on-insert</u></b> and <b><u>on-update</u></b> triggers of the <b>'created_at'</b> and <b>'modified_at'</b> columns appear to be working splendidly.

<strong>It will come in handy for us later if we place an index on user_id (above). This way, we can retreive records rapidly based on a common user_id.</strong>

In [79]:
%%sql
# Creating well-chosen secondary indexes such as this one can dramatically increase record look-up speeds.
# You can imagine a theoretical "web" of connected user data originating from multiple tables in the UA Management
# Tier. Retrieving data from these secondary indexes should only require less than 5 random disk I/O's to complete.
CREATE INDEX USER_ADMIN_INDEX  
ON adminuser (user_id);

# The user_address table
<hr/>

Address information in this table forms a well-normalized, data intensive schema that makes sense to store in a separate table. Notice that the user's name is not mentioned in any of these records. This enhances the level of privacy in the data. Each address can easily be associated with its' owner by looking up the <strong>user_id</strong> foreign key in the user table. 

The UNIQUE KEY constraint, ensures that duplicate addressess can not be entered by the user. The foreign key constraint ensures that if any record gets deleted from the user table the corresponding records will be deleted as well. We will reserve the demonstration of these on-delete triggers until the end of the presentation.

In [118]:
%%sql
# 
CREATE TABLE user_address (
    address_id INT PRIMARY KEY AUTO_INCREMENT,  #
    user_id INT,  #  user_address.user_id refers to user.user_id
    is_primary_residence BOOLEAN DEFAULT false,  # 
    address_line1 VARCHAR(100) NOT NULL,  # e.g., 1312 Cherry Basket ln.
    address_line2 VARCHAR(100),  # e.g., Unit 2
    city VARCHAR(40) NOT NULL,  # e.g., Midland
    state VARCHAR(15) NOT NULL,  # e.g., Texas
    postal_code VARCHAR(15) NOT NULL, # e.g., 79701
    country VARCHAR(56),  # e.g., United States
    phone_number VARCHAR(15) NOT NULL, # e.g., (702)579-0585
    
    UNIQUE KEY(user_id, address_line1),
    CONSTRAINT USER_ADDRESS_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [119]:
user_addresses = [[1, True, "8447C Airport Street", "Apt#2", "Klamath Falls","OR", "97603", "United States", "(102)479-4505"],
                  [1, False, "255 W. Some Other Rd.", "N/A", "Tampa","FL", "33769", "United States", "(402)455-4599"],
                  [2, True, "328 Saxton St.", "N/A", "Englewood","NJ", "07631", "United States", "(202)484-0535"],
                  [3, True, "8539 W. Olive Court", "N/A", "Bemidji","MN", "56601", "United States", "(502)474-7505"],
                  [3, True, "8546 Laurel Ave.","N/A","Avon Lake", "OH", "44012", "United States", "(102)479-4505"],
                  [4, True, "467 Cooper St.", "N/A", "Ottumwa","IA", "52501", "United States", "(702)579-0585"],
                  [5, True, "9154 Main Court", "N/A", "Latrobe","PA", "15650", "United States", "(702)579-0585"],
                  [5, False, "12 Marshall Street", "N/A", "Galena","MD", "21635", "United States", "(702)579-0585"],
                  [5, False, "2849 Peck Street", "N/A", "Manchester","NH", "03101", "United States", "(702)579-0585"],
                  [6, True, "7019 E. Border Street", "N/A", "Strongsville","Strongsville", "OH", "United States", "(702)579-0585"],
                  [7, True, "819 Aspen Ave.", "N/A", "Maplewood","NJ", "07040", "United States", "(702)579-0585"],
                  [8, True, "admin_08","9216 W. Greenview Ave.", "N/A", "Williamstown","NJ", "08094", "United States", "(502)479-4505"],
                  [9, True, "426 N. Bay Meadows Rd.", "N/A", "Largo","FL", "33771", "United States", "(402)455-4599"],                
                  # This last insert SHOULD fail since that user_id does not exist within user table.
                  # [11,True, "8320 W. Brookside Street","N/A","Streamwood", "IL", "60107", "United States", "(102)479-4505"],
                 ]

In [120]:
insert_user_address = """
INSERT INTO 
    user_address (user_id, is_primary_residence, address_line1, address_line2, city, state, postal_code, country, phone_number)
VALUES
    ("%s","%s","%s","%s","%s","%s","%s","%s","%s");
"""

for user in user_addresses:
    # res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
    try:
        res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7], user[8])
        print("user_id:", user[0], "'s address was inserted successfully.")
    except:
        print("user_id:", user[0], "'s address insertion FAILED.")

user_id: 1 's address was inserted successfully.
user_id: 1 's address was inserted successfully.
user_id: 2 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 4 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 6 's address was inserted successfully.
user_id: 7 's address was inserted successfully.
user_id: 8 's address was inserted successfully.
user_id: 9 's address was inserted successfully.
user_id: 11 's address insertion FAILED.

<strong>We can use this table to, for example, find the number of listed residences for each user with at least two homes registered.</strong>

In [144]:
%%sql
WITH count_address AS (
SELECT user_id, COUNT(user_id) AS 'num_homes'
FROM user_address
GROUP BY user_id
)

SELECT user.user_id AS 'user ID', user.first_name, user.last_name, count_address.num_homes AS 'Number of residences'
FROM user
JOIN count_address
WHERE user.user_id = count_address.user_id and count_address.num_homes >= 2;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
3 rows affected.

[(1, "'Joe'", "'Murr'", 2),
 (3, "'Jen'", "'Jackson'", 2),
 (5, "'Melanie '", "'Baldwin'", 3)]

Again, we will most likely access this data when performing an action related to a specific user, so it makes sense to place a secondary index on <b>user_id</b>.

In [83]:
%%sql
# Makes table joins run faster!
CREATE INDEX USER_RESIDENCE_INDEX  
ON user_address (user_id);

## The user_payment table
<hr/>
The user_payment table contains credit card information associated with a user by the foreign key 'user_id'. Notice how the user_id artificial key now works to enhance the privacy and security of the data in this table. Without the users' first and last name, this information is of little use to an unauthorized user, as the remainder of this sensitive information is safely hidden in another table.

In [165]:
%%sql
CREATE TABLE user_payment (
    payment_id INT PRIMARY KEY AUTO_INCREMENT,  # good to keep track of payment options.
    user_id INT NOT NULL,  # Foreign key that references user.user_id
    payment_type VARCHAR(40) NOT NULL,  # e.g.,          'DEBIT'            ...     'CREDIT'
    provider VARCHAR(100) NOT NULL,  # e.g., '(WELLS FARGO' | 'CHASE'| ...) ... ('VISA' | 'DISCOVERY' | ...) 
    card_number VARCHAR(20) NOT NULL,
    cvc VARCHAR(10) NOT NULL,  # always 3 numbers
    expiry VARCHAR(10),  # e.g., '2025-07' (cards typically expire the first day of the month.)
    
    UNIQUE KEY(user_id, card_number),
    # CONSTRAINT PAYMENT_TYPE_NO_DUPS UNIQUE(user_id, provider, card_number),  # users can have only one instance of each E-transfer provider, and one instance of each card.
    CONSTRAINT USER_PAYMENT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Place a secondary index on user_id, to easily look up their preferred payment option.

In [166]:
%%sql
# rapid look up.
CREATE INDEX USER_PAYMENT_INDEX  
ON user_payment (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<strong>We don't want any duplicate credit cards on file. So we can place a non-clustered index on (user_id, card_number) to make sure that this can't happen. Then we insert some test data, including a couple instances of records that we DON'T want to insert into the table.</strong>

In [167]:
user_payment_methods = [[1, "DEBIT", "CHASE", "4485202750970764", "505", "05/2024"],
                        [1, "CREDIT", "VISA", "4485858039365496", "391", "9/2023"], # user can have multiple cards
                        [2, "DEBIT", "VISA", "4539447657840026", "924", "07/2025"], 
                        [2, "CREDIT", "VISA", "4716013835369778", "804", "12/2024"], # 
                        [3, "CREDIT", "VISA", "4556994540374919", "536", "03/2022"],
                        [4, "DEBIT", "VISA", "4929053913134176", "958", "11/2023"],
                        [5, "CREDIT", "DISCOVERY", "4485596057592985", "713", "08/2029"],
                        [6, "CREDIT", "VISA", "4539628822621173", "121", "01/2028"],
                        [7, "CREDIT", "DISCOVERY", "4842467639356646", "548", "02/2026"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"],
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        # The user_payment table does not allow duplicate payment information to be entered into the table. 
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],  # FAIL -- duplicate card number
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"]]  # FAIL -- duplicate card number

In [168]:
insert_user_payment = """
INSERT INTO 
    user_payment (user_id, payment_type, provider, card_number, cvc, expiry)
VALUES
    ("%s","%s","%s","%s","%s", "%s");
"""

for payment in user_payment_methods:
    try:
        res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
        print("SUCCESS! user_id", payment[0], "'s payment info was inserted.")
    except:
        print("FAILED. could not insert user_id", payment[0], "'s payment information.")

SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 3 's payment info was inserted into 'user_payment'
SUCCESS! user_id 4 's payment info was inserted into 'user_payment'
SUCCESS! user_id 5 's payment info was inserted into 'user_payment'
SUCCESS! user_id 6 's payment info was inserted into 'user_payment'
SUCCESS! user_id 7 's payment info was inserted into 'user_payment'
SUCCESS! user_id 8 's payment info was inserted into 'user_payment'
SUCCESS! user_id 9 's payment info was inserted into 'user_payment'
FAILED. could not insert user_id 9 's payment information
FAILED. could not insert user_id 8 's payment information

In [537]:
%%sql
select * from user_payment
order by user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
11 rows affected.

[(1, 1, "'DEBIT'", "'CHASE'", "'4485202750970764'", "'505'", "'05/2024'"),
 (2, 1, "'CREDIT'", "'VISA'", "'4485858039365496'", "'391'", "'9/2023'"),
 (3, 2, "'DEBIT'", "'VISA'", "'4539447657840026'", "'924'", "'07/2025'"),
 (4, 2, "'CREDIT'", "'VISA'", "'4716013835369778'", "'804'", "'12/2024'"),
 (5, 3, "'CREDIT'", "'VISA'", "'4556994540374919'", "'536'", "'03/2022'"),
 (6, 4, "'DEBIT'", "'VISA'", "'4929053913134176'", "'958'", "'11/2023'"),
 (7, 5, "'CREDIT'", "'DISCOVERY'", "'4485596057592985'", "'713'", "'08/2029'"),
 (8, 6, "'CREDIT'", "'VISA'", "'4539628822621173'", "'121'", "'01/2028'"),
 (9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'"),
 (10, 8, "'DEBIT'", "'DISCOVERY'", "'4485944095819335'", "'788'", "'07/2024'"),
 (11, 9, "'CREDIT'", "'VISA'", "'4532191431974902'", "'267'", "'10/2025'")]

<strong>A major credit card company is offering a special prize to company employees who shop at our site using their credit card brand. Find the first name, last name, email, and job title (i.e., admin_type) of employees with a DISCOVERY credit card on file.</strong>

In [90]:
%%sql
# Use Common Table Expressions.
WITH admin_users AS (
    SELECT 
        adminuser.user_id AS 'user_id', user.first_name AS 'first_name', user.last_name AS 'last_name', adminuser.admin_type AS 'admin_type', 
            user.email AS 'email' 
    FROM 
        adminuser
    INNER JOIN
        user
    ON
        adminuser.user_id = user.user_id
)

SELECT * 
FROM admin_users
JOIN user_payment
ON admin_users.user_id = user_payment.user_id
WHERE user_payment.payment_type LIKE '\'%CREDIT\'' AND user_payment.provider LIKE '\'%DISCOVERY\'';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[(7, "'Malik '", "'Coleman'", "'Requisitioner'", "'admin_07_@email.com'", 9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'")]

Malik Coleman, you're a winner!

<h1>Products</h1>
<hr/>

<h3>'product', 'product_inventory', 'product_category', and 'product_discount' tables</h3>

The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_inventory'</b> is <b>1-1(1)</b>, mandatory. (open arrow dependency)
<br>The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_category'</b> is <b>1-1(0)</b>, optional.
<br>The <b>E/R relationship</b> between <b>'product'</b> and <b>'product_discount'</b> is also <b>1-1(0)</b>, optional.

In [191]:
%%sql
CREATE TABLE product_category (
    category_id INT PRIMARY KEY AUTO_INCREMENT,  # This PK is referenced by product.category_id
    category_name VARCHAR(50) UNIQUE NOT NULL,  # 
    category_desc VARCHAR(400),  #
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,  # 
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(category_name, category_desc)  # no duplicate categories.
);  
# Products belong to a product category, but the category can change, and even be NULL (product still exists if category is deleted).

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [134]:
# category_id is NOT auto-increment. Product categories is in many ways, already an index.
product_categories = [["outdoor_gear", "Camping, Fishing, and Hiking gear."],
                      ["mens_clothing", "The latest fashions in menswear."],
                      ["mens_shoes", "Find a great fit."],
                      ["womens_clothing", "Seasonal fashions, clearance prices."],
                      ["womens_shoes", "We know shoes."],
                      ["garden_supplies", "Lawn, garden, and landscaping supplies."],
                      ["sports_equipment", "Soccer, footbal, basketball, baseball and more."],
                      ["electronics", "Top tech gadgets."],
                      ["grocery", "Fresh produce, dairy, Deli and more."],
                      ["automotive", "Oil, tire, and car care products."]
                     ]

<strong> Run the following cell twice to see the product_category table prevent duplicate category names from entering the database. </strong>

In [135]:
insert_product_categories = """
INSERT INTO 
    product_category (category_name, category_desc)
VALUES
    ("%s","%s");
"""

for category in product_categories:
    try:
        res = con.execute(insert_product_categories, category[0], category[1])
        print("SUCCESS! category_id", category[0], "was inserted into 'product_category'")
    except:
        print("FAILED. Could not insert category_id", category[0], "into 'product_category'")

FAILED. Could not insert category_id outdoor_gear into 'product_category'
FAILED. Could not insert category_id mens_clothing into 'product_category'
FAILED. Could not insert category_id mens_shoes into 'product_category'
FAILED. Could not insert category_id womens_clothing into 'product_category'
FAILED. Could not insert category_id womens_shoes into 'product_category'
FAILED. Could not insert category_id garden_supplies into 'product_category'
FAILED. Could not insert category_id sports_equipment into 'product_category'
FAILED. Could not insert category_id electronics into 'product_category'
FAILED. Could not insert category_id grocery into 'product_category'
FAILED. Could not insert category_id automotive into 'product_category'

## The 'product' table
<hr/>

The category_id attribute is a foreign key that referencing a record in the product_category table. Since a product exists if it belongs to a category or not, we place an "on-delete-cascade" trigger on the attribute to set category_id=NULL when the category is deleted.

In [93]:
%%sql
DELETE FROM product_category WHERE category_id = 2;
SELECT * FROM product
LIMIT 2;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
2 rows affected.

[(1, 1, "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", "'001-OUT-001'", Decimal('199.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30)),
 (2, None, "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", "'001-MNC-003'", Decimal('119.99'), datetime.datetime(2023, 4, 30, 6, 41, 30), datetime.datetime(2023, 4, 30, 6, 41, 30))]

In [ ]:
%%sql
CREATE TABLE product (
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # TIER INDEX KEY
    category_id INT,  # FK for product_category.category_id. Product belongs to a product category. (ON DELETE, SET NULL)
    product_name VARCHAR(100),
    product_desc VARCHAR(400), 
    sku VARCHAR(15) UNIQUE, 
    price DECIMAL(13, 2),  # price must be kept as a decimal for computing discounts
    rating DECIMAL(2, 1),  # products need a rating.
    
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # If the category is deleted then all we have is a product without a category. => '...ON DELETE SET NULL'
    CONSTRAINT PRODUCT_isA_CATEGORY FOREIGN KEY (category_id) REFERENCES product_category(category_id) ON DELETE SET NULL
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

<strong>Since there is no rule against two vendors selling the same product, we distinguish each item listing using a unique SKU constraint and the AUTO_INCREMENT primary key, "product_id".</strong><br><br>
<strong> Example SKU: 'XXX-YYY-ZZZ'<br>
'XXX' = chronologic index of the products list of the selling vendor (not the same as product_id).<br>
'YYY' = three letter abbreviation of the product category, "N_A" if product category is NULL.<br>
'ZZZ' = vendor ID.</strong>

A user interface might place a secondary index on SKU, to help the user better manage his/her inventory.

In [195]:
product_list = [[1, "Outdoor Recliner", "Fold-up canvas camping chair.", "001-OUT-001", 199.99, 4.2],
                [2, "Men's Hooded Fleece", "Soft, warm and comfy men's outer garment.", "001-MNC-003", 119.99, 3.9],
                [3, "Casual Loafers", "Casual mens footwear.", "001-MNS-001", 59.99, 4.5],
                [3, "Running Shoes", "Comfortable running shoes.", "001-MNS-002", 99.99, 5.0],
                [3, "Work Boots", "Comfortable and durable mens work boots.", "001-MNS-003", 199.99, 4.0],
                [3, "Sandals", "Mens sandals.", "001-MNS-004", 39.99, 4.3],
                [3, "House Slippers", "Comfortable mens house slippers.", "001-MNS-005", 49.99, 4.7],
                [4, "Women's Scarf", "Fashionable women's scarf.", "001-WMC-002", 34.99, 2.8],
                [5, "Women's Slip-Ons", "Cozy women's slip-ons.", "001-WMS-002", 44.99, 4.5],
                [6, "Cloth Planter Pots", "Cloth planter for fruits and veggetables.", "001-GSP-002", 10.99, 4.6],
                [7, "Men's Basketball", "Top-shelf men's basketball.", "001-SPT-003", 59.99, 4.7],
                [8, "Iphone28", "The latest Iphone technology.", "001-ELC-004", 999.99, 2.0],
                [9, "Fresh Bagels", "Fresh bagels, delivered from our a bakery.", "001-GRO-005", 6.99, 1.9],
                [10, "Air Freshener", "Clip on vent air freshener.", "001-AUT-001", 6.99, 5.0],
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-AUT-001", 6.99, 4.1],  # Duplicate SKU, should FAIL.
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-GRO-005", 6.99, 3.5],  # Duplicate SKU, should FAIL.
               ]

In [196]:
insert_products = """
INSERT INTO 
    product (category_id, product_name, product_desc, sku, price, rating)
VALUES
    ("%s","%s","%s","%s","%s","%s");
"""

for product in product_list:
    try:
        res = con.execute(insert_products, product[0], product[1], product[2], product[3], product[4], product[5])
        print("SUCCESS! inserted product:", "'" + product[1] + "'|", "SKU:", product[3])
    except:
        print("FAILED. Could not insert product:", "'" + product[1] + "'|", "SKU:", product[3])

SUCCESS! inserted product: 'Outdoor Recliner'| SKU: 001-OUT-001
SUCCESS! inserted product: 'Men's Hooded Fleece'| SKU: 001-MNC-003
SUCCESS! inserted product: 'Casual Loafers'| SKU: 001-MNS-001
SUCCESS! inserted product: 'Running Shoes'| SKU: 001-MNS-002
SUCCESS! inserted product: 'Work Boots'| SKU: 001-MNS-003
SUCCESS! inserted product: 'Sandals'| SKU: 001-MNS-004
SUCCESS! inserted product: 'House Slippers'| SKU: 001-MNS-005
SUCCESS! inserted product: 'Women's Scarf'| SKU: 001-WMC-002
SUCCESS! inserted product: 'Women's Slip-Ons'| SKU: 001-WMS-002
SUCCESS! inserted product: 'Cloth Planter Pots'| SKU: 001-GSP-002
SUCCESS! inserted product: 'Men's Basketball'| SKU: 001-SPT-003
SUCCESS! inserted product: 'Iphone28'| SKU: 001-ELC-004
SUCCESS! inserted product: 'Fresh Bagels'| SKU: 001-GRO-005
SUCCESS! inserted product: 'Air Freshener'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-GRO-005

In [200]:
%%sql
select * from product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
14 rows affected.

[(1, 1, "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", "'001-OUT-001'", Decimal('199.99'), Decimal('4.2'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (2, 2, "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", "'001-MNC-003'", Decimal('119.99'), Decimal('3.9'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (3, 3, "'Casual Loafers'", "'Casual mens footwear.'", "'001-MNS-001'", Decimal('59.99'), Decimal('4.5'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (4, 3, "'Running Shoes'", "'Comfortable running shoes.'", "'001-MNS-002'", Decimal('99.99'), Decimal('5.0'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (5, 3, "'Work Boots'", "'Comfortable and durable mens work boots.'", "'001-MNS-003'", Decimal('199.99'), Decimal('4.0'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (6, 3, "'Sandals'", "'Mens sandals.'", "'001-MNS-004'", Decimal('39.99'), Decimal('4.3'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (7, 3, "'House Slippers'", "'Comfortable mens house slippers.'", "'001-MNS-005'", Decimal('49.99'), Decimal('4.7'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (8, 4, "'Women's Scarf'", "'Fashionable women's scarf.'", "'001-WMC-002'", Decimal('34.99'), Decimal('2.8'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (9, 5, "'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'001-WMS-002'", Decimal('44.99'), Decimal('4.5'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (10, 6, "'Cloth Planter Pots'", "'Cloth planter for fruits and veggetables.'", "'001-GSP-002'", Decimal('10.99'), Decimal('4.6'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (11, 7, "'Men's Basketball'", "'Top-shelf men's basketball.'", "'001-SPT-003'", Decimal('59.99'), Decimal('4.7'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (12, 8, "'Iphone28'", "'The latest Iphone technology.'", "'001-ELC-004'", Decimal('999.99'), Decimal('2.0'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (13, 9, "'Fresh Bagels'", "'Fresh bagels, delivered from our a bakery.'", "'001-GRO-005'", Decimal('6.99'), Decimal('1.9'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 (14, 10, "'Air Freshener'", "'Clip on vent air freshener.'", "'001-AUT-001'", Decimal('6.99'), Decimal('5.0'), datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7))]

<strong>Note:</strong> business-centric SKUs are the primary product tracing mechanism for many businesses.

Now we have everything we need to produce a basic product catalog that we can post to a web page. Alternatively sorted variations of this catalog can be made by sending slightly modified queries to the server handling the database. 

Indexes can be placed on any primary key attribute. These queries will work well becauase each of these tables are well-normalized. Data semantics are obscured in most transactions thanks to the relative meaninglessness of each primary key. Searches are very fast in these transactions because the tables are well-normalized and primary keys act as indexes to distinct clusters of meaningful user data, which can readily be combined by dereferencing the foreign key relationships between tables.

to filter the search results based upon the user's preference (sort by cost, for example).
The query below sorts products of the "mens_shoes" category by product rating in descending order.

In [136]:
%%sql 
WITH product_catalog AS (
SELECT
    product.product_name AS 'Name',  product.product_desc AS 'Description', product_category.category_name AS 'Category',  
        product.price AS 'Price', product.rating AS 'Rating', product.sku AS 'SKU', product.created_at AS 'created_at', product.modified_at AS 'modified_at'
FROM
    product_category
INNER JOIN
    product
ON
    product.category_id = product_category.category_id
)

SELECT * FROM product_catalog
WHERE Category LIKE '\'%mens_shoes\''  # category seach option could come from a drop-down menu.
ORDER BY product_catalog.Rating DESC
LIMIT 5;  # change the last term and sort the list by any attribute you like.

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
5 rows affected.

[("'Running Shoes'", "'Comfortable running shoes.'", "'mens_shoes'", Decimal('99.99'), Decimal('5.0'), "'001-MNS-002'", datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 ("'Casual Loafers'", "'Casual mens footwear.'", "'mens_shoes'", Decimal('59.99'), Decimal('4.5'), "'001-MNS-001'", datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 ("'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'womens_shoes'", Decimal('44.99'), Decimal('4.5'), "'001-WMS-002'", datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 ("'Sandals'", "'Mens sandals.'", "'mens_shoes'", Decimal('39.99'), Decimal('4.3'), "'001-MNS-004'", datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7)),
 ("'Work Boots'", "'Comfortable and durable mens work boots.'", "'mens_shoes'", Decimal('199.99'), Decimal('4.0'), "'001-MNS-003'", datetime.datetime(2023, 4, 30, 22, 33, 7), datetime.datetime(2023, 4, 30, 22, 33, 7))]

## The product_inventory table
<hr/>

In [9]:
%%sql
CREATE TABLE product_inventory (
    product_id INT PRIMARY KEY,  # FK+PK combined
    sku VARCHAR(15) UNIQUE, # SKU is once again unique
    qty INT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT POSITIVE_INVENTORY CHECK(qty >= 0 and qty < 2147483647),
    CONSTRAINT PRODUCT_INVENTORY FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

<strong>Therefore, the product_id attribute is a foreign key referencing a record in product table, it is also the primay key of the product_inventory table. We could include other information pertaining to the item's inventory (e.g., warehouse and shelf storage location(s)) but we will keep this table simple for know and focus on user-based transactions. </strong>
<br>
<br>
<strong><u>Note:</u> product_inventory depends on the product table for its own existence. Foreign keys in this table will contain an "on-delete-cascade" trigger. We also place boundary restrictions on 'qty' to prevent undefined behavior. Let's delete an item from the product table and check to see if it exists in product_inventory.</strong>

In [7]:
inventory = [[1, "001-OUT-001", 500],
             [2, "001-MNC-003", 350],
             [3, "001-MNS-001", 1200],
             [4, "001-MNS-002", 50],
             [5, "001-MNS-003", 14],
             [6, "001-MNS-004", 120],
             [7, "001-MNS-005", 45],
             [8, "001-WMC-002", 1],
             [9, "001-WMS-002", 20],
             [10, "001-GSP-002", 200],
             [11, "001-SPT-003", 200],
             [12, "001-ELC-004", 200],
             [13, "001-GRO-005", 200],
             [14, "001-AUT-001", 200]
            ]

In [10]:
insert_inventory = """
INSERT INTO 
    product_inventory (product_id, sku, qty)
VALUES
    ("%s","%s","%s");
"""

for item in inventory:
    # res = con.execute(insert_inventory, item[0], item[1], item[2])
    try:
        res = con.execute(insert_inventory, item[0], item[1], item[2])
        print("SUCCESS! Inserted inventory for product #:", item[0], ",", "SKU:", item[1])
    except:
        print("FAILED to insert inventory for product #:", item[0], ",", "SKU:", item[1])

In [14]:
%%sql
SELECT * FROM product_inventory LIMIT 8;  # take a look at the product_inventory table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
8 rows affected.

[(1, "'001-OUT-001'", 500, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (2, "'001-MNC-003'", 350, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (3, "'001-MNS-001'", 1200, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (4, "'001-MNS-002'", 50, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (5, "'001-MNS-003'", 14, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (6, "'001-MNS-004'", 120, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (8, "'001-WMC-002'", 1, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (9, "'001-WMS-002'", 20, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26))]

In [12]:
%%sql
DELETE FROM product WHERE product_id = 7;  # DELETE product_id #7 from the product table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[]

In [15]:
%%sql
SELECT * FROM product_inventory LIMIT 8;  # check product_inventory again.

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
8 rows affected.

[(1, "'001-OUT-001'", 500, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (2, "'001-MNC-003'", 350, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (3, "'001-MNS-001'", 1200, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (4, "'001-MNS-002'", 50, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (5, "'001-MNS-003'", 14, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (6, "'001-MNS-004'", 120, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (8, "'001-WMC-002'", 1, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26)),
 (9, "'001-WMS-002'", 20, datetime.datetime(2023, 4, 30, 22, 44, 26), datetime.datetime(2023, 4, 30, 22, 44, 26))]

<strong>We see that item with product_id number 7 has been removed from the product_inventory table as a result of the on-delete-cascade trigger placed on it.</strong>

## The product_discount table
<hr/>

<strong>Note that only one discount can be applied to one product at any given time in this model.</strong>

In [68]:
%%sql
CREATE TABLE product_discount (
    discount_id INT PRIMARY KEY AUTO_INCREMENT,  # Keep a discount history. 
    product_id INT,
    discount_name VARCHAR(40),  # e.g., 'July 4th Flash Sale'
    discount_percent DECIMAL(5,2),  # holds the percentage discount rate
    discount_desc VARCHAR(200),  # e.g., "In honor of independence day all T-shirts are 50% off!"
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # Without a product, there is no product discount.
    CONSTRAINT PRODUCT_SUPPORTS_DISCOUNT FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [69]:
%%sql
CREATE INDEX PRODUCT_DISCOUNT_INDEX  
ON product_discount (product_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [70]:
discounts = [[1, "discount_1", 0.15, "15% Discount"],
             [2, "discount_2", 0.15, "15% Discount"],
             [3, "discount_3", 0.30, "30% Discount"],
             [4, "discount_4", 0.25, "25% Discount"],
             [5, "discount_5", 0.05, "5% Discount"],
             [6, "discount_6", 0.10, "10% Discount"],
             [7, "discount_7", 0.20, "20% Discount"],  # 7 should fail bc it was deleted from the product tbl earlier.
             [8, "discount_8", 0.15, "15% Discount"],
             [9, "discount_9", 0.05, "5% Discount"],
             [10, "discount_10", 0.10, "10% Discount"],
             [11, "discount_11", 0.25, "25% Discount"],
             [12, "discount_12", 0.40, "40% Discount"],
             [13, "discount_13", 0.75, "75% Discount"],
             [14, "discount_14", 0.20, "20% Discount"]
            ]

In [71]:
insert_discounts = """
INSERT INTO 
    product_discount (product_id, discount_name, discount_percent, discount_desc)
VALUES
    ("%s","%s","%s","%s");
"""

for item in discounts:
    # res = con.execute(insert_inventory, item[0], item[1], item[2], item[3])
    try:
        res = con.execute(insert_discounts, item[0], item[1], item[2], item[3])
        print("SUCCESS! Inserted:", item[1])
    except:
        print("FAILED to insert:", item[1])

SUCCESS! Inserted: discount_1
SUCCESS! Inserted: discount_2
SUCCESS! Inserted: discount_3
SUCCESS! Inserted: discount_4
SUCCESS! Inserted: discount_5
SUCCESS! Inserted: discount_6
FAILED to insert: discount_7
SUCCESS! Inserted: discount_8
SUCCESS! Inserted: discount_9
SUCCESS! Inserted: discount_10
SUCCESS! Inserted: discount_11
SUCCESS! Inserted: discount_12
SUCCESS! Inserted: discount_13
SUCCESS! Inserted: discount_14

<h3>Now we can view the product table with discounts applied.</h3>

In [74]:
%%sql
SELECT  product.product_name AS 'Product', 
        product.product_id AS 'Product ID',
        product.price AS 'Original Price ($)', 
        product_discount.discount_percent AS 'Discount Rate (%)', 
        ROUND(product.price - (product.price*product_discount.discount_percent),2) AS 'Discounted Price ($)',
        product_discount.discount_desc AS 'Discount Description'
        
FROM product
JOIN product_discount
ON product.product_id = product_discount.product_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
13 rows affected.

[("'Outdoor Recliner'", 1, Decimal('199.99'), Decimal('0.15'), Decimal('169.99'), "'15% Discount'"),
 ("'Men's Hooded Fleece'", 2, Decimal('119.99'), Decimal('0.15'), Decimal('101.99'), "'15% Discount'"),
 ("'Casual Loafers'", 3, Decimal('59.99'), Decimal('0.30'), Decimal('41.99'), "'30% Discount'"),
 ("'Running Shoes'", 4, Decimal('99.99'), Decimal('0.25'), Decimal('74.99'), "'25% Discount'"),
 ("'Work Boots'", 5, Decimal('199.99'), Decimal('0.05'), Decimal('189.99'), "'5% Discount'"),
 ("'Sandals'", 6, Decimal('39.99'), Decimal('0.10'), Decimal('35.99'), "'10% Discount'"),
 ("'Women's Scarf'", 8, Decimal('34.99'), Decimal('0.15'), Decimal('29.74'), "'15% Discount'"),
 ("'Women's Slip-Ons'", 9, Decimal('44.99'), Decimal('0.05'), Decimal('42.74'), "'5% Discount'"),
 ("'Cloth Planter Pots'", 10, Decimal('10.99'), Decimal('0.10'), Decimal('9.89'), "'10% Discount'"),
 ("'Men's Basketball'", 11, Decimal('59.99'), Decimal('0.25'), Decimal('44.99'), "'25% Discount'"),
 ("'Iphone28'", 12, Decimal('999.99'), Decimal('0.40'), Decimal('599.99'), "'40% Discount'"),
 ("'Fresh Bagels'", 13, Decimal('6.99'), Decimal('0.75'), Decimal('1.75'), "'75% Discount'"),
 ("'Air Freshener'", 14, Decimal('6.99'), Decimal('0.20'), Decimal('5.59'), "'20% Discount'")]

<h1>Shopping</h1>
<h2>The 'cart_item' and 'cart_session' tables</h2>
<hr>

The shopping cart is the most complicated section. This is where the concepts of 'shopping cart' and 'purchase' come into effect. This section involves tables from the user-admin and product management tier, in addition to new tables supported by the user and product strong entities.
<br><br>
<u><b>Note:</b></u><i> We need to implement tables for <b>'cart_session'</b> and <b>'cart_item'</b> to support the shopping process.</i> These are transient tables.

In [90]:
%%sql
# a cart belongs to a single user
CREATE TABLE cart_session (
    cart_id INT PRIMARY KEY AUTO_INCREMENT,
    user_id INT UNIQUE,  # Only one cart_session at a time per user.
    cart_total DECIMAL(10,2),
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT CART_PRODUCT_FK FOREIGN KEY (user_id) REFERENCES user(user_id)
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [89]:
%%sql
DROP TABLE IF EXISTS cart_session;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [88]:
%%sql
# The user has to delete cart items, before they can delete the cart session. 
DROP TABLE IF EXISTS cart_item;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [91]:
user_id = 1  # Joe Murr
create_cart_session = """
INSERT INTO 
    cart_session (user_id, cart_total)
VALUES
    ("%s",0.00);
"""
try:
    res = con.execute(create_cart_session, user_id)
    print("SUCCESS! Created a cart_session for user_id:", user_id)
except:
    print("FAILED to insert:", user_id)

SUCCESS! Created a cart_session for user_id: 1

<strong>Joe Murr creates a cart, so a tuple is entered in the cart_session table. He hasn't added any items yet, so his cart_total is $0.00. The cart_session table keeps track of the running total for the shopping session. Each cart_session supports zero to many [(0)M] cart_items. cart_item tuples are linked to at most one cart_session record through the cart_id foreign key relationship. </strong>

In [92]:
%%sql
SELECT user.user_id, cart_session.cart_id, cart_session.cart_total, first_name, last_name, email 
FROM user
JOIN cart_session
ON cart_session.user_id = user.user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[(1, 1, Decimal('0.00'), "'Joe'", "'Murr'", "'user_01_@email.com'")]

<h2> ON-INSERT-UPDATE TRIGGER </h2>

<strong>Now, we can place an on-insert-update trigger on the cart_item table, s.t. inserting a cart item increases cart_session.total by the appropriate amount. </strong> <br>
<strong>We also need an on-delete-cascade on the foreign key constriant placed on cart_item.cart_id and cart_item.product_id, since a cart item cannot exist without either of these supporting types.</strong><br>
<strong>We use (cart_id, product_id) as a combined primary key for the cart_item records.</strong>

In [94]:
%%sql
# cart items belong to a cart
CREATE TABLE cart_item (
    cart_item_id INT PRIMARY KEY AUTO_INCREMENT,
    cart_id INT,   # Supporting type #1
    product_id INT,  # Supporting type #2
    item_qty INT,  # Number of cart_items units added to the cart
    unit_price DECIMAL(13,2),  # Unit price of cart_item
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    UNIQUE KEY(cart_id, product_id),
    
    CONSTRAINT CART_ITEM_FK1 FOREIGN KEY (cart_id) REFERENCES cart_session(cart_id) ON DELETE CASCADE,
    CONSTRAINT CART_ITEM_FK2 FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

Make the on-insert trigger for cart_item.

In [95]:
%%sql
DROP TRIGGER IF EXISTS `increase_total`;

CREATE TRIGGER increase_total AFTER INSERT ON cart_item
    FOR EACH ROW UPDATE cart_session
        SET cart_total = (cart_total + (new.item_qty*new.unit_price))
        WHERE cart_session.cart_id = new.cart_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [96]:
%%sql
DROP TRIGGER IF EXISTS `update_total`;
# Now, we need a trigger that will decrease the cart_total when a cart_item qty is decreased.
CREATE TRIGGER update_total BEFORE UPDATE ON cart_item
    FOR EACH ROW UPDATE cart_session
        SET cart_total = ((cart_total - (old.item_qty*old.unit_price)) + (new.item_qty*new.unit_price))
        WHERE cart_session.cart_id = new.cart_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [97]:
# 'Outdoor Recliner'	1	199.99	0.15	169.99	'15% Discount'  (x5)
# 'Men's Hooded Fleece'	2	119.99	0.15	101.99	'15% Discount'  (X2)
cart_item = [[1, 4, 5, 74.99], 
             [1, 2, 2, 101.99]
            ]

In [99]:
insert_cart_items = """
INSERT INTO 
    cart_item (cart_id, product_id, item_qty, unit_price)
VALUES
    ("%s","%s","%s","%s");
"""
# res = con.execute(insert_cart_items, cart_item)
for item in cart_item:
    try:
        res = con.execute(insert_cart_items, item[0], item[1], item[2], item[3])
        print("SUCCESS! Created a cart_item insert with qty:", item[2], "for product_id:", item[1])
    except:
        print("FAILED to insert product_id:", item[1])

FAILED to insert product_id: 4
FAILED to insert product_id: 2

In [132]:
%%sql
WITH filled_cart AS (
SELECT cart_session.cart_id, cart_session.user_id, cart_item.cart_item_id, cart_item.item_qty, cart_item.unit_price, cart_session.cart_total
FROM cart_session
JOIN cart_item
ON cart_session.cart_id = cart_item.cart_id
),
user_cart AS (
SELECT filled_cart.cart_id, filled_cart.user_id, user.first_name, user.last_name, filled_cart.cart_item_id, filled_cart.item_qty, filled_cart.unit_price, filled_cart.cart_total
FROM filled_cart
JOIN user
ON filled_cart.user_id = user.user_id
)

SELECT user_cart.cart_id, product.product_name, product.product_desc, user_cart.item_qty, user_cart.unit_price, user_cart.cart_total
FROM user_cart
JOIN product
ON user_cart.cart_item_id = product.product_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
2 rows affected.

[(1, "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", 4, Decimal('74.99'), Decimal('503.94')),
 (1, "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", 2, Decimal('101.99'), Decimal('503.94'))]

<h3>Let's say Joe Murr only needs 4 camping chairs for his upcoming trip...</h3>
Let's find out if the on-update trigger we placed on the cart_item table is computing the quantity and cart_total fields correctly.
<br><br>


We update the item count using an update-set-where clause that accepts inputs which can easily be gathered from an html form.

In [131]:
change_qty =""" 
            UPDATE 
                cart_item 
            SET 
                item_qty = "%s"
            WHERE 
                cart_id = "%s" and product_id = "%s";
            """
item_update = [4, 1, 4]
res = con.execute(change_qty, item_update[0], item_update[1], item_update[2])

<h3>Now run the cell with the ctes again to find out if the trigger works!</h3>
Notice the apparent meaninglessness of the data being exchanged in the cell above. Without knowledge of the table schema, and an index to dereference the INT primary keys, this data exchange would be meaningless to a malicious user.